# Напишите программу, которая будет
# преобразовывать десятичное число в двоичное.

nb = int(input("nb = "))
print("{0:b}".format(nb))
